
import 'package:flutter/src/widgets/framework.dart';
import 'package:flutter/src/widgets/placeholder.dart';
import 'package:flutter/material.dart';

import '../components/card.dart';

class CancerGuide extends StatefulWidget {
  const CancerGuide({super.key});

  @override
  State<CancerGuide> createState() => _CancerGuideState();
}

class _CancerGuideState extends State<CancerGuide> {
  String? inf;
  List i = [
    // 'images/reasonable.png ',
    // 'images/problem.png ',
    'images/diagnose.png',
    'images/assessment.png'
        'images/list.png',
    'images/diagnose.png',
    'images/assessment.png'
  ];

  List cardNames = [
    'دليل السرطان',
    'أسباب السرطان',
    'مضاعفات السرطان',
    'أنواع و أعراض',
    'الفحوصات اللازمة'
  ];
  List cardDetails = [
    '''يتكون جسم الإنسان من الترليونات من الخلايا، وتوجد عدة أنواع للخلايا مثل خلايا الجلد، والقلب، والكبد، والعضلات، وهذه الخلايا تقوم بالانقسام والنمو عند الحاجة وذلك للحفاظ على جسم صحي وسليم.

السرطان هو نمو غير طبيعي للخلايا في الجسم بسبب حدوث خلل فيها، والذي يمكن أن يحدث في أي جزء من أجزاء الجسم نتيجة وجود خلل في الأنظمة الطبيعية الخلوية التي تتحكم بانقسام الخلايا وتكاثرها، مما يؤدي إلى عدم موت الخلايا القديمة واستمرارها بالنمو وتكوين خلايا غير طبيعية، ينتج عن ذلك تكون كتل من الأنسجة التي تعرف بالأورام وظهور أعراض السرطان.

وعند تكون السرطان، لا يمكن للجسم السيطرة على نمو خلايا الورم، فتنمو دون توقف، وفي مرحلة لاحقة تنتشر إلى أجزاء أخرى من الجسم، وهذه بدورها تنمو وتتلف الأنسجة والأعضاء التي حولها.

لا تؤدي جميع أنواع السرطان إلى تكون الأورام، حيث أن بعض أنواع السرطان، مثل سرطان الدم، لا تسبب تتطور الأورام، كما أن ليس جميع الأورام التي تتكون في الجسم تعتبر أورام سرطانية، حيث أن الأورام الحميدة  هي أورام غير سرطانية ولا تنتشر إلى الأنسجة المجاورة، ولا تعود كتلة الورم بالظهور بعد إزالتها في معظم الأحيان.

بينما قد تنتشر الأورام الخبيثة إلى أجزاء أخرى من الجسم من خلال انفكاك بعض الخلايا من مكان الورم الى أجزاء بعيدة من الجسم عن طريق الدورة الدموية أو الجهاز الليمفاوي وتكون أورام جدية في مناطق أخرى من الجسم، وهو ما يعرف بانتشار السرطان ، لذلك تعتبر أورام سرطانية، ويعتبر السرطان في هذه الحالة ضمن المراحل المتقدمة، الأمر الذي يزيد من خطورته وصعوبة علاجه.

تمتلك خلايا السرطان القدرة على التهرب من جهاز المناعة، المسؤول عن إزالة الخلايا الضارة والتالفة  والأجسام الغريبة من الجسم، حيث يمكن لخلايا السرطان "الاختباء" من جهاز المناعة ومواصلة التكاثر بالرغم من وجوده.



''',
///////////////////
    '''يتطور السرطان نتيجة حدوث ضرر أو تشوهات في جينات معينة تتحكم في دورة حياة الخلايا، بما فيها النمو، والوظائف، والانقسام، والموت، حيث ينتج عن هذه الأضرار عدم اتزان بين النمو الطبيعي للخلايا وموتها.

من الصعب تحديد أسباب الإصابة بالسرطان عند الأشخاص بسبب تنوعها، إلا أن المسببات وعوامل الخطر التي قد تؤدي إلى إلحاق الضرر بالجينات والحمض النووي المتحكمة بالخلايا تتضمن ما يلي:

التشوهات، بعض التشوهات الجينية قد تؤدي إلى تطور السرطان بسبب الاختلال في الاتزان ببعض أنواع الجينات مثل طليعة الجينات الورمية والجينات الكابتة للورم والجينات المسؤولة عن إصلاح الحمض النووي، فعلى سبيل المثال تم ربط حدوث تشوهات في جين BRCA1 وجين BRCA2 بزيادة خطر الإصابة بسرطان الثدي وسرطان المبيض، حيث يمكن أن تنتقل هذه التشوهات في الجينات من جيل إلى آخر مسببةً زيادة وراثية في خطر الإصابة بالسرطان.
العوامل البيئية، يمكن أن تسبب بعض العوامل البيئية الإصابة بالسرطان، مثل التعرض المستمر لأشعة الشمس وما تحمله من الأشعة فوق البنفسجية الذي يسبب سرطان الجلد، بالإضافة إلى العديد من الملوثات الجوية أو الملوثات التي يمكن التعرض لها في بيئة العمل، مثل الدخان الناتج عن السيارات والمصانع، وغبار الأخشاب، والاسبست، وبعض المركبات البلاستيكية، وغيرها.
الجراثيم، بعض الجراثيم والكائنات الدقيقة تؤدي إلى زيادة خطر الإصابة بالسرطان مثل جرثومة المعدة التي تزيد من خطورة الإصابة بسرطان المعدة، بالإضافة إلى بعض أنواع الفيروسات مثل فيروس التهاب الكبد ب، وفيروس التهاب الكبد سي، وفيروس الورم الحليمي البشري، وفيروس ايبشتاين بار.
أسلوب الحياة والنظام الغذائي، قد تزيد بعض الاختيارات الحياتية الخاطئة من خطر الإصابة بالسرطان، مثل التدخين فهو مرتبط بعدة أنواع من الأورام، مثل أورام الرئة، والمريء، والمثانة، بالإضافة إلى تناول الأطعمة غير الصحية، وقلة النشاط البدني، والسمنة، والإفراط في تناول الكحول، وكثرة تناول الأطعمة المشوية على الفحم.
الإشعاع، حيث يزيد التعرض لبعض أنواع الإشعاع من خطورة الإصابة بالسرطان، مثل الإشعاع المؤين الذي يمكن التعرض له عن طريق الأشعة السينية، أو إشعاع عنصر الرادون من التربة، بالإضافة إلى الإشعاع غير المؤين الذي يمكن التعرض له عن طريق أشعة الشمس وما تحمله من أشعة فوق بنفسجية.
الأدوية، يزيد استعمال بعض الأدوية من خطر الإصابة بالسرطان مثل بعض الأدوية المضادة للأورام، وبعض الأدوية الهرمونية، وبعض الأدوية التي تسبب ضعف المناعة.
بعض المواد الكيميائية والمعادن، مثل التعرض للنيكل والكادميوم والأفلاتوكسين.
عوامل خطر أخرى قد تسبب السرطان ويمكن تجنبها:

شرب كميات كبيرة من الكحول.
زيادة وزن الجسم بشكل كبير.
قلة الحركة والخمول.
سوء التغذية.
بالرغم من وجود عدة عوامل مسببة للسرطان قد يتعرض لها الإنسان خلال حياته، إلا أنه ليس بالضرورة أن يصاب به، ويفسر ذلك بكمية ومدة تعرضه لعوامل الخطر، حيث تزيد احتمالية الإصابة بزيادة التعرض لعوامل الخطر، كما يتميز بعض الأشخاص بزيادة وقوة الإستجابة المناعية المسؤولة عن التخلص من الخلايا غير الطبيعية لديهم، مما يقلل خطر تعرضهم للسرطان.
''',
///////////////////////////
    '''قد يسبب السرطان وعلاجه مضاعفات عديدة بما في ذلك ما يلي:
*الألم. قد يتسبب السرطان أو علاجه في شعور المريض بالألم، ورغم ذلك ليست كل أنواع السرطان مؤلمة. وقد تعالج الأدوية والأساليب الأخرى بفعالية الألم المصاحب للسرطان.
*الإرهاق. تتعدد أسباب شعور الأشخاص المصابين بالسرطان بالإرهاق، ولكن يمكن علاجه غالبًا. والإرهاق المصاحب للعلاج الكيميائي أو العلاج الإشعاعي من الأمور الشائعة، لكن عادةً ما يكون مؤقتًا.
*صعوبة التنفس. قد يسبب السرطان أو علاجه الشعور بضيق في التنفس. وقد تخفف العلاجات هذه المشكلة.
*الغثيان. قد تسبب بعض أنواع السرطان وعلاجاته الغثيان. ويستطيع طبيبك أحيانًا أن يتنبأ بما إذا كان من المرجح أن يتسبب العلاج في شعورك بالغثيان أم لا. وقد تساعد الأدوية والعلاجات الأخرى على منع الغثيان أو الحد منه.
*الإسهال أو الإمساك. قد يؤثر السرطان وعلاجه في أمعائك وقد يسبب الإسهال أو الإمساك.
*فقدان الوزن. قد يسبب السرطان وعلاجه فقدان الوزن، فهو يسرق الطعام من الخلايا الطبيعية ويحرمها من العناصر المغذية. وهذا النوع لا يتأثر عادةً بعدد السعرات الحرارية أو نوع الطعام الذي يتم تناوله، ومن الصعب علاجه. وفي معظم الحالات، لا يساعد استخدام التغذية الاصطناعية من خلال الأنابيب إلى المعدة أو الوريد على تقليل فقدان الوزن.
*التغييرات الكيميائية في جسمك. قد يتسبب السرطان في اختلال التوازن الكيميائي الطبيعي في جسمك وزيادة احتمال إصابتك بمضاعفات خطيرة. وقد تتضمن المؤشرات والأعراض الخاصة باختلال التوازن الكيميائي العطش الشديد وكثرة التبوّل والإمساك والارتباك.
*مشكلات الدماغ والجهاز العصبي. قد يضغط السرطان على الأعصاب القريبة وقد يسبب الألم وفقدان وظائف جزء من جسمك. ويمكن أن يسبب السرطان الذي يؤثر في الدماغ الصداع ومؤشرات وأعراضًا تشبه السكتة الدماغية، مثل الشعور بالضعف في جانب واحد من الجسم.
*التفاعلات غير الطبيعية للجهاز المناعي مع السرطان. في بعض الحالات، قد يتفاعل الجهاز المناعي للجسم مع السرطان من خلال مهاجمة الخلايا السليمة. ويمكن أن تؤدي هذه التفاعلات النادرة جدًا التي تسمى متلازمات الأباعد الورمية إلى مجموعة من المؤشرات والأعراض، مثل صعوبة المشي والنوبات المرضية.
*انتشار السرطان. مع تفاقم السرطان، قد ينتشر (ينتقل) في أجزاء أخرى من الجسم. ويعتمد مكان انتشار السرطان على نوع السرطان.
*عودة السرطان. يتعرض الناجون من السرطان لمخاطر تكرار الإصابة بالسرطان. ومن المرجح أن بعض السرطانات تعاود الظهور أكثر من سرطانات أخرى. اسأل طبيبك بشأن ما يمكنك فعله لتقليل مخاطر تكرار الإصابة بالسرطان. وقد يعد طبيبك خطة رعاية تفقدية لك بعد العلاج. ويمكن أن تتضمن هذه الخطة إجراء فحوصات واختبارات دورية خلال الشهور والسنوات التالية لعلاجك من أجل الكشف عن مخاطر تكرار الإصابة بالسرطان.''',
/////////////////////////
    '''قد يسبب السرطان وعلاجه مضاعفات عديدة بما في ذلك ما يلي:
*الألم. قد يتسبب السرطان أو علاجه في شعور المريض بالألم، ورغم ذلك ليست كل أنواع السرطان مؤلمة. وقد تعالج الأدوية والأساليب الأخرى بفعالية الألم المصاحب للسرطان.
*الإرهاق. تتعدد أسباب شعور الأشخاص المصابين بالسرطان بالإرهاق، ولكن يمكن علاجه غالبًا. والإرهاق المصاحب للعلاج الكيميائي أو العلاج الإشعاعي من الأمور الشائعة، لكن عادةً ما يكون مؤقتًا.
*صعوبة التنفس. قد يسبب السرطان أو علاجه الشعور بضيق في التنفس. وقد تخفف العلاجات هذه المشكلة.
*الغثيان. قد تسبب بعض أنواع السرطان وعلاجاته الغثيان. ويستطيع طبيبك أحيانًا أن يتنبأ بما إذا كان من المرجح أن يتسبب العلاج في شعورك بالغثيان أم لا. وقد تساعد الأدوية والعلاجات الأخرى على منع الغثيان أو الحد منه.
*الإسهال أو الإمساك. قد يؤثر السرطان وعلاجه في أمعائك وقد يسبب الإسهال أو الإمساك.
*فقدان الوزن. قد يسبب السرطان وعلاجه فقدان الوزن، فهو يسرق الطعام من الخلايا الطبيعية ويحرمها من العناصر المغذية. وهذا النوع لا يتأثر عادةً بعدد السعرات الحرارية أو نوع الطعام الذي يتم تناوله، ومن الصعب علاجه. وفي معظم الحالات، لا يساعد استخدام التغذية الاصطناعية من خلال الأنابيب إلى المعدة أو الوريد على تقليل فقدان الوزن.
*التغييرات الكيميائية في جسمك. قد يتسبب السرطان في اختلال التوازن الكيميائي الطبيعي في جسمك وزيادة احتمال إصابتك بمضاعفات خطيرة. وقد تتضمن المؤشرات والأعراض الخاصة باختلال التوازن الكيميائي العطش الشديد وكثرة التبوّل والإمساك والارتباك.
*مشكلات الدماغ والجهاز العصبي. قد يضغط السرطان على الأعصاب القريبة وقد يسبب الألم وفقدان وظائف جزء من جسمك. ويمكن أن يسبب السرطان الذي يؤثر في الدماغ الصداع ومؤشرات وأعراضًا تشبه السكتة الدماغية، مثل الشعور بالضعف في جانب واحد من الجسم.
*التفاعلات غير الطبيعية للجهاز المناعي مع السرطان. في بعض الحالات، قد يتفاعل الجهاز المناعي للجسم مع السرطان من خلال مهاجمة الخلايا السليمة. ويمكن أن تؤدي هذه التفاعلات النادرة جدًا التي تسمى متلازمات الأباعد الورمية إلى مجموعة من المؤشرات والأعراض، مثل صعوبة المشي والنوبات المرضية.
*انتشار السرطان. مع تفاقم السرطان، قد ينتشر (ينتقل) في أجزاء أخرى من الجسم. ويعتمد مكان انتشار السرطان على نوع السرطان.
*عودة السرطان. يتعرض الناجون من السرطان لمخاطر تكرار الإصابة بالسرطان. ومن المرجح أن بعض السرطانات تعاود الظهور أكثر من سرطانات أخرى. اسأل طبيبك بشأن ما يمكنك فعله لتقليل مخاطر تكرار الإصابة بالسرطان. وقد يعد طبيبك خطة رعاية تفقدية لك بعد العلاج. ويمكن أن تتضمن هذه الخطة إجراء فحوصات واختبارات دورية خلال الشهور والسنوات التالية لعلاجك من أجل الكشف عن مخاطر تكرار الإصابة بالسرطان.''',
    '''يوجد ما يزيد على 200 نوع من أنواع السرطان يصعب ذكرها جميعاً هنا، إلا أنه يمكن تقسيمها إلى مجموعات رئيسية تتضمن ما يلي:
 1-السرطانة : وهو السرطان الذي يتطور في طبقة الخلايا السطحية في الأعضاء أو الأنسجة التي تغطي الأعضاء الداخلية للجسم، وغالباً ما تكون أورام صلبة، وهي أكثر أنواع السرطان انتشاراً (80- 90% من حالات السرطان)، وتتضمن سرطان الجلد، وسرطان الرئة، وسرطان الثدي، وسرطان القولون، وسرطان البنكرياس، وسرطان البروستات، وغيرها.
2-الورم اللحمي أو الساركوما : وهو السرطان الذي يتطور في العظام، أو الغضاريف، أو المفاصل، أو الأوتار، أو الدهون، أو العضلات، أو الأعصاب، أو الأوعية الدموية، أو الأوعية اللمفية، أو الأنسجة الضامة الأخرى.
3-سرطان الدم أو ابيضاض الدم : وهو السرطان الذي يتطور في الأنسجة التي تقوم بتصنيع الدم مثل نخاع العظم، ويؤدي إلى إنتاج كميات كبيرة من خلايا الدم غير الطبيعية، وتشمل أنواعه الرئيسية ابيضاض اللمفاويات الحاد وابيضاض اللمفاويات المزمن، والابيضاض النخاعي الحاد، والابيضاض النخاعي المزمن، بالإضافة إلى غيرها من الأنواع.
4-السرطان اللمفاوي : وهو السرطان الذي يتطور في خلايا جهاز المناعة، والذي يشمل بشكل أساسي ورم الغدد اللمفاوية الهودجكيني، واللمفومة اللاهودجكينية، بالإضافة إلى غيرها من الأنواع
5-سرطان الجهاز العصبي المركزي، وهو السرطان الذي يتطور في الدماغ والحبل الشوكي، مثل الورم الدبقي، أو الورم غدي نخامي، وغيرها.
6-الورم النخاعي أو الورم النقي : وهو السرطان الذي يتطور في خلايا البلازما التي يتم إنتاجها في نخاع العظم، ويشمل هذه النوع الورم النقيي المتعدد .
7-سرطان الجلد : وهو السرطان الذي يتطور في الخلايا الملانية التي تنتج صبغة الميلانين، مما ينتج عنها تكون السرطان في الجلد وبعض الأنسجة التي توجد فيها صبغة الميلانين مثل العين.
8-أورام الخلايا الجنسية : وهي الأورام التي تتطور في الخلايا المكونة للحيوانات المنوية عند الذكور وتسمى سرطان الخصية، أو في البويضات عند الإناث، ويمكن أن تظهر في أي مكان في الجسم.
9-الأورام العصبية الصماوية : وهي الأورام التي تتطور من الخلايا التي تقوم بإفراز الهرمونات في الدم التي يتم التحكم بها عن طريق إشارات من الجهاز العصبي، مما يؤدي إلى إنتاج كميات كبيرة من الهرمونات في الجسم ويؤدي إلى ظهور أعراض مختلفة تبعاً لنوع الهرمون الذي يتم انتاجه بكمية زائدة.
10-الأورام السرطانية : وهي نوع من الأورام العصبية الصماوية التي تنمو بصورة بطيئة وتوجد غالبآ في الجهاز الهضمي، ويمكن أن تنتشر الى أجزاء أخرى من الجسم وتفرز بعض النواقل العصبية مثل السيروتونين والبروستاغلاندين مما يسبب المتلازمة السرطانية .\n 11-سرطان الثدي: يعتبر سرطان الثدي أكثر أنواع السرطان انتشاراً في الولايات المتحدة الأمريكية، ومن أكثرها خطورة، حيث يقدر أن واحدة من كل 8 نساء سوف تعاني من سرطان الثدي في أحد مراحل حياتها، وتتضمن بعض أعراضه ظهور كتلة قاسية أو زيادة في سمك الثدي أو أسفل الإبط، وتغير في حجم أو شكل الثدي، وخروج إفرازات مفاجئة من حلمة الثدي تحتوي على الدم أو تخرج من ثدي واحد فقط، وألم مستمر في الثدي، وغيرها. 
12-سرطان الرئة: يعتبر سرطان الرئة أكثر أنواع السرطان خطورة للرجال والنساء على حد سواءً، وهو أكثر أنواع السرطان انتشاراً على مستوى العالم، وتتضمن بعض أعراضه ضيق النفس، وألم الصدر، والسعال الذي قد يحتوي على الدم، وفقدان الشهية، وفقدان الشهية، وخسارة الوزن، وغيرها.
13-سرطان البروستات: وهو أكثر أنواع السرطان التي تصيب الرجال، وتتضمن بعض أعراضه كثرة التبول، وضعف مجرى البول، وكثرة الحاجة للتبول ليلاً، وظهور الدم في البول أو في السائل المنوي، وضعف الانتصاب، وغيرها.
14-سرطان المبيض: يعتبر سرطان المبيض من أكثر أنواع السرطان التي تصيب النساء، ويتسبب بما يقارب 5% من وفيات مرض السرطان، وتتضمن بعض أعراضه تطبل البطن، وآلام في منطقة الحوض والبطن والظهر، وصعوبة في تناول الطعام، أو سرعة الشعور بالشبع، وسوء الهضم، وعدم انتظام في الدورة الشهرية، والألم أثناء الجماع، والإمساك، وخروج إفرازات مهبلية قد تكون صافية، أو بيضاء، أو مختلطة بالدم، وغيرها.
15-سرطان البنكرياس: يمتلك سرطان البنكرياس أعلى معدل وفيات بين جميع أنواع السرطان الرئيسية، حيث أن 8% فقط من المصابين به يعيشون لمدة تزيد عن 5 سنوات بعد الإصابة، وتتضمن بعض أعراضه اليرقان، وألم في أعلى البطن أو الظهر، تورم مؤلم في أحد الذراعين أو الرجلين، حرقة المعدة أو غيرها من أعراض عدم الارتياح في القناة الهضمية، والغثيان والتقيؤ، وفقدان الشهية، وخسارة الوزن، وغيرها.
16-سرطان القولون والمستقيم : وهو من أخطر أنواع السرطان التي تؤثر على الرجال والنساء معاً، وتتضمن بعض أعراضه تغير في عادات استعمال الحمام، والإمساك أو الإسهال، أو الشعور بأن الأمعاء لا يتم إفراغها بشكل كامل، ووجود دم أحمر فاقع أو غامق جداً في البراز، والمعاناة من فقر الدم بعوز الحديد دون وجود مسبب، وعدم ارتياح في منطقة البطن ناتج عن الغازات، أو تشنج المعدة، وغيرها.
17-سرطان الكبد: يصيب سرطان الكبد الرجال بشكل أكبر من النساء، ويزيد شرب الكحول، والإصابة بالتهاب الكبد الفيروسي من خطر الإصابة به، وتتضمن بعض أعراضه ألم في أعلى البطن أو الظهر، وخسارة للوزن، وظهور كتلة قاسية أسفل الأضلاع، والشعور بالتعب والإرهاق، وغيرها.
18-سرطان الكلى: قد يؤثر سرطان الكلى على إحدى أو على كلتا الكليتين، وغالباً ما يؤثر على كبار العمر، ويصيب الرجال بشكل أكبر من النساء، وتتضمن بعض أعراضه ظهور دم في البول، الشعور بألم أو بضغط على الجوانب أو الظهر، وظهور كتلة في الظهر أو على الجوانب، وتورم في الكاحلين والرجلين، وارتفاع ضغط الدم، وفقر الدم، وفقدان الشهية، وخسارة الوزن، والتعب والإرهاق، وغيرها.
19-اللمفومة اللاهودجكينية: قد تصيب بعض الأنواع الفرعية لهذا النوع من السرطان الأطفال الصغار، إلا أنه أكثر انتشاراً لدى البالغين، حيث يزيد خطر الإصابة به مع التقدم بالعمر، ويؤثر بشكل أكبر على الرجال من النساء، وتتضمن بعض أعراضه تضخم في العقد اللمفاوية في البطن، والفخذ، والرقبة، وتحت الإبطين، وتضخم في الطحال أو الكبد، وحمى غير معروفة السبب، وخسارة الوزن، والتعرق والقشعريرة، وغيرها.
20-سرطان الفم: والذي قد يؤثر على أي من تراكيب التجويف الفموي مثل الشفاه، أو اللثة، أو اللسان، وغيرها، وسرطان الحلقوم، الذي قد يؤثر على أجزاء من الحلق، أو اللوزتين، وغيرها، ونؤثر هذه الأنواع من السرطان بشكل أكبر على الرجال، وتتضمن بعض أعراضه تقرحات الفم أو الشفاه لا تتعافى، وظهور بقع حمراء أو بيضاء على اللسان، أو الشفاه، أو اللوزتين، والتهاب مستمر في الحلق أو الشعور بوجود شيء عالق في الحلق، وبحة الصوت، ورائحة الفم السيئة المزمنة، وخدران في الفم أو اللسان، وألم أو نزيف في الفم، وغيرها.
21-سرطان الجلد : يتطور هذا النوع من السرطان في الخلايا الميلانينية، وهي الخلايا التي تنتج صبغة أو لون الجلد، ويمكن أن يؤثر على أي منطقة من الجسم، وهو أكثر انتشاراً لدى النساء قبل سن الخمسين، إلا أنه يصبح أكثر انتشاراً عند الرجال بعد سن الخامسة والستين، وتتضمن بعض أعراضه حدوث تغيرات في حجم، أو شكل، أو لون، أو ملمس أحد الشامات الموجودة أصلاً، أو قد ينمو سرطان الجلد على شكل شامة غير تقليدية.
22-سرطان الرحم: يعتبر سرطان الرحم أكثر أنواع السرطان التي تصيب الجهاز التناسلي لدى المرأة انتشاراً، ويتطور في أكثر الحالات (ما يقارب 90%) في بطانة الرحم، وتتضمن بعض أعراضه حدوث نزيف مهبلي أو إفرازات غير طبيعية، وغزارة الطمث ، وألم في منطقة الحوض، وغيرها.

 ''',
    ///////////////////////////
    '''يتم في بعض الأحيان تشخيص وجود السرطان أثناء القيام بإجراء الفحوصات التقليدية لأي مشكلة طبية، حيث أن كثيراً من مرضى السرطان لا يعانون من أي أعراض، إلا أن أغلب حالات السرطان يتم تشخيصها عند بدء ظهور الأورام، أو معاناة المريض من أعراض غير طبيعية تدفعه لمراجعة الطبيب.

يبدأ تشخيص السرطان بعمل:

فحص جسدي سريري شامل للمريض، وأخذ تاريخه الطبي.
بعض الفحوصات المخبرية مثل تحليل الدم الشامل، أو تحليل البول، أو البراز قد تساعد على الكشف عن بعض الاعتلالات التي تشير إلى وجود السرطان.
وفي حالات الشك في وجود الأورام يتم اللجوء إلى بعض الفحوصات التصويرية مثل:

الأشعة السينية.
التصوير المقطعي المحوسب .
التصوير بالرنين المغناطيسي.
التصوير بالموجات فوق الصوتية.
عمليات التنظير، وغيرها من الفحوصات التي تساعد على تحديد مكان وحجم الأورام.
عادة ما يتم أخذ خزعة من الورم لتأكيد تشخيص السرطان، وهي عبارة عن عينة يتم أخذها من الورم ودراستها مجهرياً للتحقق من احتوائها على خلايا سرطانية من عدمه، وفي حالة إيجابية الفحص يتم القيام بفحوصات أخرى للحصول على مزيد من المعلومات حول السرطان، ونوعه، ومرحلته، ومدى انتشاره في الجسم.

يهدف الفحص المبكر إلى تشخيص الأورام قبل أن تظهر منها أية أعراض، وهذا يكون عادة في مرحلة مبكرة، حيث يكون الورم صغيرا جداً ويسهل علاجه والشفاء منه ولكن لا يمكن تشخيص كل الأورام بالفحص المبكر.

أهم الأورام التي يمكن تشخيصها بالفحص المبكر:

أورام الثدي: عن طريق عمل صور الثدي  دورياً.
أورام القولون والمستقيم: عن طريق فحص البراز أو التنظير.
أورام الجلد: عن طريق الفحص الدوري في عيادة الجراحة.
'''
  ];
  int currentIndex = 0;
  @override
  Widget build(BuildContext context) {
    return Scaffold(
      body: Padding(
        padding: const EdgeInsets.symmetric(vertical: 70, horizontal: 15),
        child: ListView(
          scrollDirection: Axis.vertical,
          children: [
            SizedBox(
              height: 200,
              child: ListView.builder(
                itemCount: i.length,
                scrollDirection: Axis.horizontal,
                itemBuilder: (BuildContext ctx, int index) {
                  return customcard(
                    ontap: () {
                      currentIndex = index;
                      setState(() {});
                    },
                    image: i[index],
                    text: cardNames[index],
                  );
                },
              ),
            ),
            Expanded(child: Container(child: Text(cardDetails[currentIndex])))
          ],
        ),
      ),
    );
  }
}
